// 7. Сравнить null и 0. Попробуйте объяснить результат.

/* Ответ:
0 - метематическое цифровое значение, известная величина нуля, которая имеет смысл в арифметической и другой математике.
null - не является значением, это "заполнитель" для значения данных, которое неизвестно или не указано.

Основное отличие состоит в том, что 0 относится к измеряемой величине, а NULL - о существовании.
Будучи количеством, 0 представляет что-то , то есть количество, то есть 0, как 0.000000001 представляет количество.
В отличие от этого NULL представляет ничег . На самом деле нет ничего близкого к NULL. Любое значение переменной (и выражений) либо NULL, либо что-то.
*/
